
IDENTIFICATION DIVISION.
PROGRAM-ID. FIBONACCI.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.

01  NUM-TERMOS      PIC 9(2)  VALUE ZEROES.
01  CONTADOR        PIC 9(2)  VALUE ZEROES.
01  TERMO-ANTERIOR  PIC 9(2)  VALUE ZEROES.
01  TERMO-ATUAL     PIC 9(2)  VALUE ZEROES.

PROCEDURE DIVISION.
    MAIN-PARA.
        DISPLAY "QUANTOS TERMOS DA SEQUENCIA DE FIBONACCI?".
        ACCEPT NUM-TERMOS.
        MOVE 1 TO TERMO-ANTERIOR.
        MOVE 1 TO TERMO-ATUAL.
        PERFORM MOSTRA-TERMOS
        VARYING CONTADOR FROM 2 BY 1
            UNTIL CONTADOR = NUM-TERMOS.
        STOP RUN
    MOSTRA-TERMOS.
        DISPLAY TERMO-ATUAL.
        ADD TERMO-ANTERIOR TO TERMO-ATUAL
            GIVING TERMO-ANTERIOR.
        MOVE TERMO-ATUAL TO TERMO-ANTERIOR.
